// Build a history of previously used remote management and monitoring tools. Set to 90 days to pickup occaisional sysadmin events.
// To avoid false/benign positives comment out the relevant line for your tool, or refine the KQL to detect anomalies from your normal use of the tool
let RMMHistory = (DeviceProcessEvents
    | where TimeGenerated between (ago(90d) .. ago(1h)) and FileName has_any (
        "acticalrmm",
        "action1",
        "aeroadmin",
        "agentmon.exe",
        "ammyy",
        "anydesk",
        "atera",
        "ateraagent.exe",
        "aterarc.exe",
        "auvik.agent.exe",
        "auvik.engine.exe",
        "awesome-rat",
        "basupsrvc",
        "basupsrvccnfg",
        "ccme_sm.exe",
        "chaos",
        "chrome remote desktop",
        "connectwise",
        "dameware",
        "domotz.exe",
        "domotzclient.exe",
        "ehorus",
        "fixme",
        "flawedammyy",
        "friendspeak",
        "get2",
        "getandgo",
        "getasrsettings.exe",
        "gotoassist",
        "intelliadmin",
        "ir_agent.exe",
        "klnagent.exe",
        "konea.exe",
        "kworking.exe",
        "logmein",
        "logmein.exe",
        "ltaservice.exe",
        "ltclient.exe",
        "ltsvcmon.exe",
        "meshcentral",
        "mremoteng",
        "mstsc.exe"
        "napclt.exe",
        "netsupport",
        "ngrok",
        "ninjarmm",
        "ninjarmm.exe",
        "ninjarmmagent.exe",
        "nssm",
        "ocs agent",
        "pdqdeploy",
        "plink",
        "pulseway.trayapp.exe",
        "pulsewayservice.exe",
        "putty.exe",
        "quickassist",
        "radmin",
        "rclone",
        "realvnc",
        "remote manipulator system",
        "remote utilities",
        "remotepc",
        "rustdesk",
        "screenconnect",
        "screenconnect.client.exe",
        "screenconnect.clientservice.exe",
        "screenconnect.service.exe",
        "screenconnect.windowsclient.exe",
        "splashtop",
        "srutility",
        "supremo",
        "syncro",
        "tacticalrmm",
        "takecontrolrdviewer.exe",
        "tanium",
        "teamviewer.exe",
        "tigervnc",
        "tightvnc",
        "tmate",
        "ultraviewer",
        "vncclient.exe",
        "vncconnect",
        "wapt",
        "webex remote",
        "winvnc.exe",
        "za_access_my_department"
        "za_connect.exe",
        "zohoassist"
        )
    | extend Pattern = strcat(AccountName, DeviceName, FileName)
    | distinct Pattern);
// Now look for any DeviceProcessEvents where the pattern is not in RMMHistory
DeviceProcessEvents
| extend Pattern = strcat(AccountName, DeviceName, FileName)
| where TimeGenerated > ago(1h) and Pattern !in (RMMHistory) and FileName has_any (
    "acticalrmm",
    "action1",
    "aeroadmin",
    "agentmon.exe",
    "ammyy",
    "anydesk",
    "atera",
    "ateraagent.exe",
    "aterarc.exe",
    "auvik.agent.exe",
    "auvik.engine.exe",
    "awesome-rat",
    "basupsrvc",
    "basupsrvccnfg",
    "ccme_sm.exe",
    "chaos",
    "chrome remote desktop",
    "connectwise",
    "dameware",
    "domotz.exe",
    "domotzclient.exe",
    "ehorus",
    "fixme",
    "flawedammyy",
    "friendspeak",
    "get2",
    "getandgo",
    "getasrsettings.exe",
    "gotoassist",
    "intelliadmin",
    "ir_agent.exe",
    "klnagent.exe",
    "konea.exe",
    "kworking.exe",
    "logmein",
    "logmein.exe",
    "ltaservice.exe",
    "ltclient.exe",
    "ltsvcmon.exe",
    "meshcentral",
    "mremoteng",
    "mstsc.exe"
    "napclt.exe",
    "netsupport",
    "ngrok",
    "ninjarmm",
    "ninjarmm.exe",
    "ninjarmmagent.exe",
    "nssm",
    "ocs agent",
    "pdqdeploy",
    "plink",
    "pulseway.trayapp.exe",
    "pulsewayservice.exe",
    "putty.exe",
    "quickassist",
    "radmin",
    "rclone",
    "realvnc",
    "remote manipulator system",
    "remote utilities",
    "remotepc",
    "rustdesk",
    "screenconnect",
    "screenconnect.client.exe",
    "screenconnect.clientservice.exe",
    "screenconnect.service.exe",
    "screenconnect.windowsclient.exe",
    "splashtop",
    "srutility",
    "supremo",
    "syncro",
    "tacticalrmm",
    "takecontrolrdviewer.exe",
    "tanium",
    "teamviewer.exe",
    "tigervnc",
    "tightvnc",
    "tmate",
    "ultraviewer",
    "vncclient.exe",
    "vncconnect",
    "wapt",
    "webex remote",
    "winvnc.exe",
    "za_access_my_department"
    "za_connect.exe",
    "zohoassist"
    )
| project
    TimeGenerated,
    AccountName,
    DeviceName,
    ActionType,
    FileName,
    FolderPath,
    ProcessVersionInfoProductVersion,
    ProcessCommandLine,
    InitiatingProcessCommandLine,
    InitiatingProcessParentFileName,
    Pattern
